---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsSingle
source: html/d0cb300b-c097-dc81-f296-8285261bfdc0.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsSingle Method

Sets the Layout Rule property of rebar set to Single.

## Syntax (C#)
```csharp
public void SetLayoutAsSingle()
```

## Remarks
Only one bar will remain, which is at the position of rebar plane